tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "koekeishiya/formulae"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "shaunsingh/sfmono-nerd-font-ligaturized"
tap "sst/tap"
# Shell extension to jump to frequently used directories
brew "autojump"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Console Bonsai is a bonsai tree generator, written in C using ncurses
brew "cbonsai"
# Cross-platform make
brew "cmake"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Configurable static site generator
brew "hugo"
# Tool to report network interface bandwidth
brew "ifstat"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Powerful, lightweight programming language
brew "lua"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Retrieves currently playing media, and simulates media actions
brew "nowplaying-cli"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Simple and easy-to-use library to learn videogames programming
brew "raylib"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Library for using TrueType fonts in SDL applications
brew "sdl2_ttf"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Terminal multiplexer
brew "tmux"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Terraform
brew "hashicorp/tap/terraform"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
cask "font-blex-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-sf-pro"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
