tap "felixkratz/formulae"
tap "koekeishiya/formulae"
tap "shaunsingh/sfmono-nerd-font-ligaturized"
brew "autojump"
brew "cmake"
brew "eza"
brew "fzf"
brew "git"
brew "go"
brew "hugo"
brew "ifstat"
brew "jq"
brew "lazygit"
brew "lua"
brew "neovim"
brew "node"
brew "nowplaying-cli"
brew "pipx"
brew "raylib"
brew "ripgrep"
brew "sdl2"
brew "sdl2_image"
brew "sdl2_ttf"
brew "starship"
brew "switchaudio-osx"
brew "tmux"
brew "zsh-autosuggestions"
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "font-blex-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-sf-pro"
cask "sf-symbols"
